clc;
n=22;
eps=0.0001;
A = [-1 -1
    1 -2
    -3 2
    -1 0
    1 0
    0 -1
    0 1];

b = [-2*n n 2*n 0 4*n 0 3*n];

f = [1 1
    -3 1
    1 -3];

x=[3*n 2*n];

fz=zeros(3,1);

format bank;

for i=1:3
    ft=[f(i,1) f(i,2)];
    y = linprog(-ft,A,b);
    fprintf("X*"+ i+ "=\n");
    disp(y);
    fz(i,1)=ft(1,1)*y(1,1)+ft(1,2)*y(2,1);
    fprintf("F*"+ i+ "=\n");
    disp(fz(i,1));
end

grad(1,1)=(f(1,1)^2)*2+(f(2,1)^2)*2+(f(3,1)^2)*2;
grad(1,2)=(f(1,1)*f(1,2))*2+(f(2,1)*f(2,2))*2+(f(3,1)*f(3,2))*2;
grad(1,3)=(f(1,1)*(-fz(1,1)))*2+(f(2,1)*(-fz(2,1)))*2+(f(3,1)*(-fz(3,1)))*2;
grad(2,1)=(f(1,1)*f(1,2))*2+(f(2,1)*f(2,2))*2+(f(3,1)*f(3,2))*2;
grad(2,2)=(f(1,2)^2)*2+(f(2,2)^2)*2+(f(3,2)^2)*2;
grad(2,3)=(f(1,2)*(-fz(1,1)))*2+(f(2,2)*(-fz(2,1)))*2+(f(3,2)*(-fz(3,1)))*2;

i=1;
raz=eps+1;
while(eps<raz)
    fvs(1,1)=grad(1,1)*x(i,1)+grad(1,2)*x(i,2)+grad(1,3);
    fvs(1,2)=grad(2,1)*x(i,1)+grad(2,2)*x(i,2)+grad(2,3);
    y = linprog(fvs,A,b);

    xt(1,1)=x(i,1);
    xt(1,2)=y(1,1)-x(i,1);
    xt(2,1)=x(i,2);
    xt(2,2)=y(2,1)-x(i,2);
    
    lammas(1,1)=xt(1,2)*f(1,1)+xt(2,2)*f(1,2);
    lammas(1,2)=xt(1,2)*f(2,1)+xt(2,2)*f(2,2);
    lammas(1,3)=xt(1,2)*f(3,1)+xt(2,2)*f(3,2);
    
    cmas(1,1)=xt(1,1)*f(1,1)+xt(2,1)*f(1,2)-fz(1,1);
    cmas(1,2)=xt(1,1)*f(2,1)+xt(2,1)*f(2,2)-fz(2,1);
    cmas(1,3)=xt(1,1)*f(3,1)+xt(2,1)*f(3,2)-fz(3,1);
    
    lam=abs(((cmas(1,1)*lammas(1,1)+cmas(1,2)*lammas(1,2)+cmas(1,3)*lammas(1,3))*2)/((lammas(1,1)^2+lammas(1,2)^2+lammas(1,3)^2)*2));
    
    x(i+1,1)=xt(1,1)+xt(1,2)*lam;
    x(i+1,2)=xt(2,1)+xt(2,2)*lam;
    
    xpr=(f(1,1)*x(i,1)+f(1,2)*x(i,2)-fz(1,1))^2+(f(2,1)*x(i,1)+f(2,2)*x(i,2)-fz(2,1))^2+(f(3,1)*x(i,1)+f(3,2)*x(i,2)-fz(3,1))^2;
    xtek=(f(1,1)*x(i+1,1)+f(1,2)*x(i+1,2)-fz(1,1))^2+(f(2,1)*x(i+1,1)+f(2,2)*x(i+1,2)-fz(2,1))^2+(f(3,1)*x(i+1,1)+f(3,2)*x(i+1,2)-fz(3,1))^2;
    
    raz=abs(xpr-xtek);
    
    fprintf("Номер итерации - "+i+"\n");
    fprintf("Лямбда = "+lam+"\n");
    fprintf("X"+(i-1)+"("+x(i,1)+", "+x(i,2)+")\n");
    fprintf("X"+i+"("+x(i+1,1)+", "+x(i+1,2)+")\n");
    fprintf("p(X"+(i-1)+") = "+xpr+"\n");
    fprintf("p(X"+i+") = "+xtek+"\n");
    fprintf("Разность = "+raz+"\n");
    i=i+1;
end
i=i-1;
fprintf("Ответ (при эпсилон равное " +eps+"): X"+i+"("+x(i+1,1)+", "+x(i+1,2)+")\n");

